Tester1cExpansion/src/InformationRegisters/Tester_ДопСведенияШаблонныхДанных/Tester_ДопСведенияШаблонныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Tester_ДопСведенияШаблонныхДанных</name>
  <attributes>
    <name>ИменаКолонокИсключений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодЗапросаКТаблице</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester1cExpansion/src/InformationRegisters/Tester_ДопСведенияШаблонныхДанных/ManagerModule.bsl
Функция ПолучитьИменаКолонокИсключенийДляТаблицы(ИмяТаблицы) ЭКСПОРТ
	
	ИменаКолонокИсключений = новый Массив;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ИмяТаблицы",СокрЛП(ИмяТаблицы));
	Запрос.Текст = "ВЫБРАТЬ
	|	Tester_ДопСведенияШаблонныхДанных.ИменаКолонокИсключений КАК ИменаКолонокИсключений
	|ИЗ
	|	РегистрСведений.Tester_ДопСведенияШаблонныхДанных КАК Tester_ДопСведенияШаблонныхДанных
	|ГДЕ
	|	Tester_ДопСведенияШаблонныхДанных.ИмяТаблицы = &ИмяТаблицы";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		ИменаКолонокИсключений = СтрРазделить(Выборка.ИменаКолонокИсключений,";",Ложь);	
	КонецЕсли;
		
	Возврат ИменаКолонокИсключений;	
КонецФункции

Функция ПолучитьМетодЗапросаКТаблице(ИмяТаблицы) ЭКСПОРТ
	
	ИмяМетода = "";
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ИмяТаблицы",СокрЛП(ИмяТаблицы));
	Запрос.Текст = "ВЫБРАТЬ
	|	Tester_ДопСведенияШаблонныхДанных.МетодЗапросаКТаблице КАК МетодЗапросаКТаблице
	|ИЗ
	|	РегистрСведений.Tester_ДопСведенияШаблонныхДанных КАК Tester_ДопСведенияШаблонныхДанных
	|ГДЕ
	|	Tester_ДопСведенияШаблонныхДанных.ИмяТаблицы = &ИмяТаблицы";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		ИмяМетода = Выборка.МетодЗапросаКТаблице;	
	КонецЕсли;
		
	Возврат ИмяМетода;	
КонецФункции
